cpp_gsoap/cpp_files/PTZBinding.ModifyPresetTour.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex"
  xmlns:wsa5="http://www.w3.org/2005/08/addressing"
  xmlns:xmime="http://tempuri.org/xmime.xsd"
  xmlns:xop="http://www.w3.org/2004/08/xop/include"
  xmlns:tt="http://www.onvif.org/ver10/schema"
  xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
  xmlns:wsrfbf="http://docs.oasis-open.org/wsrf/bf-2"
  xmlns:wstop="http://docs.oasis-open.org/wsn/t-1"
  xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
  xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl">
 <SOAP-ENV:Header>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <tptz:ModifyPresetTour>
    <tptz:ProfileToken></tptz:ProfileToken>
    <tptz:PresetTour token="">
     <tt:Name></tt:Name>
     <tt:Status>
      <tt:State>Idle</tt:State>
      <tt:CurrentTourSpot>
       <tt:PresetDetail>
        <tt:PresetToken></tt:PresetToken>
       </tt:PresetDetail>
       <tt:Speed>
        <tt:PanTilt x="0.0" y="0.0" space="">
        </tt:PanTilt>
        <tt:Zoom x="0.0" space="">
        </tt:Zoom>
       </tt:Speed>
       <tt:StayTime>0</tt:StayTime>
       <tt:Extension>
       </tt:Extension>
      </tt:CurrentTourSpot>
      <tt:Extension>
      </tt:Extension>
     </tt:Status>
     <tt:AutoStart>false</tt:AutoStart>
     <tt:StartingCondition>
      <tt:RecurringTime>0</tt:RecurringTime>
      <tt:RecurringDuration>0</tt:RecurringDuration>
      <tt:Direction>Forward</tt:Direction>
      <tt:Extension>
      </tt:Extension>
     </tt:StartingCondition>
     <tt:TourSpot>
      <tt:PresetDetail>
       <tt:PresetToken></tt:PresetToken>
      </tt:PresetDetail>
      <tt:Speed>
       <tt:PanTilt x="0.0" y="0.0" space="">
       </tt:PanTilt>
       <tt:Zoom x="0.0" space="">
       </tt:Zoom>
      </tt:Speed>
      <tt:StayTime>0</tt:StayTime>
      <tt:Extension>
      </tt:Extension>
     </tt:TourSpot>
     <tt:TourSpot>
      <tt:PresetDetail>
       <tt:PresetToken></tt:PresetToken>
      </tt:PresetDetail>
      <tt:Speed>
       <tt:PanTilt x="0.0" y="0.0" space="">
       </tt:PanTilt>
       <tt:Zoom x="0.0" space="">
       </tt:Zoom>
      </tt:Speed>
      <tt:StayTime>0</tt:StayTime>
      <tt:Extension>
      </tt:Extension>
     </tt:TourSpot>
     <tt:Extension>
     </tt:Extension>
    </tptz:PresetTour>
   </tptz:ModifyPresetTour>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
